<?php

### Дії з числами :

## Отримати залишок від ділення 7 на 3
$result = 7 % 3;
echo "Отримати залишок від ділення 7 на 3 = " . $result;

## Отримати цілу частину ділення 7 и 7,15
$num1 = 7;
$num2 = 7.15;
$result = (int)($num1 / $num2);
echo "ціла частина ділення числа $num1 на $num1: $result";

## Отримати корінь из 25 :
$number = 25;
$root = pow($number, 1 / 5);
echo "Корінь з $number дорівнює $root";

### Дії зі строкаи :

## Отримати 4-е слово з фрази - Десять негритят пошли купаться в море :
$phrase = "Десять негритят пошли купаться в море";
$words = explode(" ", $phrase);
$fourth_word = $words[3];
echo $fourth_word; // Виведе: купаться

## Отримати 17-й символ із фрази - Десять негритят пошли купаться в море :
$rase = "Десять негритят пошли купаться в море";
$character = mb_substr($rase, 16, 1);
echo $character;

## Зробити великою кожну першу букву слів фрази - Десять негритят пошли купаться в море :
$rase = "Десять негритят пошли купаться в море";
$uppercaseRase = mb_convert_case($rase, MB_CASE_TITLE);
echo $uppercaseRase;

## Порахувати длину строки - Десять негритят пошли купаться в море :
$string = "Десять негритят пошли купаться в море";
$length = mb_strlen($string);
echo "Длина строки =  " . $length;

### Дії з логіческими даними :

## Чи вірно твердження true дорівнює 1 :
if (true == 1) {
    echo "Твердження true дорівнює 1.";
} else {
    echo "Твердження true не дорівнює 1.";
}

## Чи вірно твердження false тождественно 0 :
if (false === 0) {
    echo "Твердження 'false тотожне 0'";
} else {
    echo "Твердження 'false не тотожне 0'";
}

## Яка строка більше three - три :
$str1 = "three - три";
$str2 = "three";

if (strlen($str1) > strlen($str2)) {
    echo "Перший рядок довший за другий";
} elseif (strlen($str1) < strlen($str2)) {
    echo "Другий рядок довший за перший";
} else {
    echo "Рядки мають однакову довжину";
}

## Яке число більше 125 умножить на 13 плюс 7 или 223 плюс 28 умножить 2 :
$num1 = (125 * 13) + 7;
$num2 = 223 + (28 * 2);

if ($num1 > $num2) {
    echo "Перше число більше за друге: $num1";
} elseif ($num1 < $num2) {
    echo "Друге число більше за перше: $num2";
} else {
    echo "Обидва числа рівні: $num1";
}